w12d1-jbuilder/demo/teatime/app/controllers/api/teas_controller.rb

  def index
    @teas = Tea.all
---
SELECT "teas".* FROM "teas"

  def create
    # debugger
    @tea = Tea.new(tea_params)
    if @tea.save # remember no bang
---
INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "tiger"], ["price", 5.0], ["description", ""], ["created_at", "2022-10-21 17:40:05.381933"], ["updated_at", "2022-10-21 17:40:05.381933"]]

  def show
    @tea = Tea.find(params[:id])
    @transactions = @tea.transactions.includes(:user)
---
SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transactions"."id" FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]